org/jpacheco.xyz.org
*** fz-themes
#+begin_src emacs-lisp
(defun custom-jp-themes (&optional theme-dir)

  (defun custom-jp-themes (&optional theme-dir)
	"Return a list of custom themes from a specified directory.
Search the directory for files named FOO-theme.el, and return a list of FOO symbols,
excluding the 'default' theme and any internal themes.

If THEME-DIR is nil, it defaults to `~/.emacs.d/lisp/jp-themes/'."
	(let ((suffix "-theme\\.el\\'")
          (directory (or theme-dir "~/.emacs.d/lisp/jp-themes/"))
          themes)
      ;; Ensure the directory exists
      (when (file-directory-p directory)
		;; Iterate over all theme files in the directory
		(dolist (file (directory-files directory nil suffix))
          (let ((theme (intern (substring file 0 (string-match-p suffix file)))))
			;; Add to the list if it's valid, and exclude Emacs built-in "default" theme
			(and (not (eq theme 'default))  ;; Ensure "default" is excluded
               (not (memq theme themes))  ;; Avoid duplicates
               (push theme themes)))))
      (nreverse themes)))

  (defcustom fz-themes nil
	"List of themes (symbols or regexps) to be presented for selection.
nil shows all `custom-available-themes'."
	:type '(repeat (choice symbol regexp)))

  (defun fz-theme (theme)
	"Disable current themes and enable THEME from `fz-themes`.

The command supports previewing the currently selected theme."
	(interactive
	 (list
      (let* ((regexp (consult--regexp-filter
                      (mapcar (lambda (x) (if (stringp x) x (format "\\`%s\\'" x)))
                              fz-themes)))
			 (avail-themes (seq-filter
							(lambda (x) (string-match-p regexp (symbol-name x)))
							(custom-jp-themes)))  ;; Only use themes from custom-jp-themes
			 (saved-theme (car custom-enabled-themes)))
		(consult--read
		 (mapcar #'symbol-name avail-themes)
		 :prompt "Theme: "
		 :require-match t
		 :category 'theme
		 :history 'consult--theme-history
		 :lookup (lambda (selected &rest _)
                   (setq selected (and selected (intern-soft selected)))
                   (or (and selected (car (memq selected avail-themes)))
                      saved-theme))
		 :state (lambda (action theme)
                  (pcase action
					('return (fz-theme (or theme saved-theme)))
					((and 'preview (guard theme)) (fz-theme theme))))
		 :default (symbol-name (or saved-theme 'default))))))
	(when (eq theme 'default) (setq theme nil))
	(unless (eq theme (car custom-enabled-themes))
      (mapc #'disable-theme custom-enabled-themes)
      (when theme
		(if (custom-theme-p theme)
			(enable-theme theme)
          (load-theme theme :no-confirm)))))
#+end_src
*** Custom functions.
#+BEGIN_SRC emacs-lisp
;; Open files in the lisp folder
(require 'find-lisp)
(defun open-lisp-and-org-files ()
  "Open a Lisp or Org file from ~/.emacs.d/lisp directory, including subfolders."
  (interactive)
  (let* ((directory "~/.emacs.d/lisp")
         (el-files (find-lisp-find-files directory ".*\\.el$"))
         (org-files (find-lisp-find-files directory ".*\\.org$"))
         (all-files (append el-files org-files))
         (file (completing-read "Select file: " all-files nil t)))
    (find-file file)))

;; Follow urls in the buffer
(defun list-and-open-url-in-buffer ()
  "List all URLs in the current buffer, display them in the minibuffer, and open a selected URL in the browser."
  (interactive)
  (let (urls)
    (save-excursion
      (goto-char (point-min))
      (while (re-search-forward "\\(http\\|https\\|ftp\\|file\\|mailto\\):[^ \t\n]+" nil t)
        (push (match-string 0) urls)))
    (if urls
        (let ((url (completing-read "Select URL to open: " (reverse urls) nil t)))
          (browse-url url))
      (message "No URLs found in the buffer."))))

;; Export org files to pdf using tectonic
(defun org-export-to-latex-and-compile-with-tectonic ()
  "Export the current Org file to LaTeX, then compile with tectonic using shell-escape."
  (interactive)
  (let* ((org-file (buffer-file-name))
         (tex-file (concat (file-name-sans-extension org-file) ".tex"))
         (tectonic-command (concat "tectonic -Z shell-escape " tex-file)))
    ;; Export Org file to LaTeX
    (org-latex-export-to-latex)
    ;; Run tectonic command in a temporary buffer to avoid displaying the output
    (with-temp-buffer
      (shell-command tectonic-command (current-buffer)))
    (message "Compiled %s to PDF with Tectonic." tex-file)))

(global-set-key (kbd "C-c e l") 'org-export-to-latex-and-compile-with-tectonic)

;; Update my web-page
(defun publish-my-blog ()
  "Export all subtrees with Hugo, then run the publish blog script within Emacs and display a success message in the minibuffer."
  (interactive)
  (let ((commit-msg (read-string "Enter commit message: ")))
    ;; Export all subtrees with Hugo
    (org-hugo-export-wim-to-md :all-subtrees)
    ;; Run the publish script
    (let ((process (start-process-shell-command
                    "publish-blog"                       ; Process name
                    "*publish-blog-output*"              ; Output buffer
                    (format "~/webdev/jpachecoxyz.github.io/hugo/publish.sh \"%s\"" commit-msg))))  ; Run the script with the commit message
      ;; Set up the process sentinel to check the process status
      (set-process-sentinel
       process
       (lambda (process event)
         (when (string= event "finished\n")
           (message "jpacheco.xyz was correctly updated!")))))))

(global-set-key (kbd "C-c u b") 'publish-my-blog)

;; Search roam
(defun jp/search-roam ()
  "Run consult-ripgrep on the org roam directory"
  (interactive)
  (consult-ripgrep org-roam-directory nil))
(global-set-key (kbd "C-c n s") 'jp/search-roam)

(defun jp/yt-shorts-timer ()
  (interactive)
  (org-timer-set-timer "55s"))
(global-set-key (kbd "<f4>") 'jp/yt-shorts-timer)
#+END_SRC
** Linux
** Python
*** Avoid SSL verification when installing packages through pip.
I have some issues with the firewall in one of my jobs, so in order to be able to install python packages through pip we need to skip the =SSL= verification with the following flags.
#+begin_src shell
pip install --no-cache-dir --trusted-host pypi.org --trusted-host pypi.python.org --trusted-host files.pythonhosted.org <program>
#+end_src
** Robots
** Windows
*** Change IP address within terminal.
This cmd script prompt for an IP to b changed in the computer. Must run as root/administrator.
#+begin_src bat
@echo off
setlocal

rem Prompt the user for new IP address
set /p newIP="Enter the new IP address: "
set "newSubnetMask=255.255.255.0"

rem Set the new IP address while keeping existing subnet mask and gateway
netsh interface ipv4 set address name="Ethernet" static %newIP% %newSubnetMask% 

rem Display the new IP configuration

if %errorlevel% equ 0 (
    echo IP address changed successfully.
) else (
    echo Failed to change IP address. Please make sure you have administrative privileges.
)

endlocal
#+end_src

